#define _CRT_SECURE_NO_WARNINGS

#include<stdio.h>
#include<stdlib.h>
#include<math.h>
#include<windows.h>
#include<string.h>
//int main()
//{
//	int a = 20;
//	int *p = &a;
//	int b = -10;
//	system("pause");
//	return 0;
//}



//大端（存储）模式，是指数据的低位保存在内存的高地址中，而数据的高位，保存在内存的低地址中；
//小端（存储）模式，是指数据的低位保存在内存的低地址中，而数据的高位, ，保存在内存的高地址中。
//
//size_t
//int check_sys()
//{
//	int i = 1;
//	//返回1表示小端  返回0表示大端
//	return (*(char*)&i);
//}

//int check_sys()
//{
//	union Un
//	{
//		int i;
//		char a;
//	}u;
//	u.i = 1;
//	return u.a;
//}
//int main()
//{
//	int ret = 0;
//	ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	system("pause");
//	return 0;
//}



//int main()
//{
//	char a = -1;  //-1
//	signed char b = -1;   //-1
//	unsigned char c = -1;   
//	printf("a=%d,b=%d,c=%d\n", a, b, c);
//	//system("pasue");
//	system("pause");
//	return 0;
//}
//10000000 00000000 00000000 00000001   原码
//11111111 11111111 11111111 11111110    反码
//11111111 11111111 11111111 11111111    补码
//11111111 

//1000 0001  原码
//1111 1110   反码
//1111 1111    补码
//整型提升  向前补原符号位
// unsigned 无符号整型  整数的原反补一样
//11111111 11111111 11111111 11111111   补码   反码   原码
//11111111
//11111111 11111111 11111111 11111111   补码
//11111111 11111111 11111111 11111110   反码
//10000000 00000000 00000000 00000001   原码   -1
//4294967168


////？？？？？？？
//int main()
//{
//	char a = -128;
//	//1000 0000    原码                       10000000 000000000 000000000 10000000
//	//1111 1111    反码                       11111111 111111111 111111111 01111111
//	//1111 1110    补码                       11111111 111111111 111111111 01111110
//	//10000000 00000000 00000000 10000000
//	//1000 0000     补码
//	//11111111 11111111 11111111 10000000    a
//	
//	//原码 10000000
//	//原码 11111111 11111111 11111111 10000000
//	//反码 10000000 00000000 00000000 01111111
//	//补码 10000000 00000000 00000000 01111110   整形提升后
//	//
//
//	//a是char类型只能存放8个比特位  ？？？？
//	//整型提升
//	printf("%d\n", a); 
//	printf("%u\n", a);//254      
//	system("pause");
//	return 0;
//}


int main()
{
	char a = 128;
	char a = -128;
	//c10000000000000000000000010000000
	//10000000
	//11111111111111111111111110000000
	//00000000 00000000 00000000 10000000   
	// 10000000
	// 11111111 11111111 11111111 10000000    补码
	// 11111111 11111111 11111111 01111111
	// 10000000 00000000 00000000 10000000
	//10000000  a  原码 需要整型提升
	printf("%u\n", a);   //%u无符号整型
	printf("%d\n", a);
	system("pause");
	return 0;
}


//
//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	//10000000 00000000 00000000 00010100  -20    原码
//	//11111111 11111111 11111111 11101011          反码
//	//11111111 11111111 11111111 11101100        补码
//	//00000000 00000000 00000000 00001010   10    原反补相同
//	//11111111 11111111 11111111 11110110      补码
//	//11111111 11111111 11111111 11110101      反码
//	//10000000 00000000 00000000 00001010   原码
//	
//	printf("%d\n", i + j);
//	system("pause");
//	return 0;
//}
//
//char a
//-128   <==>   127
//unsigned char a
//0-255
//
//short b
//-32768  <==>   32767
//unsigned short b
//0-65535


//int main()
//{
//	char a = 127;
//	char b = 3;
//	char c = a + b;
//	printf("%d\n", c);
//	system("pause");
//	return 0;
//}

//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//
//		Sleep(1000);
//		printf("%u\n", i);
//	}
//	system("pause");
//	return 0;
//}

//int main()
//{
//	char a[1000];//cahr最多可以表示-1 -2 - 3 . .... -127 128 127   ..... 3 2 1 0 -1 - 2
//	int i;
//	for (i = 0; i<1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d\n", strlen(a));
//	system("pause");
//	return 0;
//}

//#include <stdio.h> 
//unsigned char i = 0;//全局变量  0-255循环出现
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}

////浮点型在内存中的存储
////常见的浮点数：
////3.14159 1E10 浮点数家族包括： float、double、long double 类型。 浮点数表示的范围：float.h中定义
////浮点数存储的例子：
//int main()
//{
//	int n = 9;
//	float *pFloat = (float *)&n;
//	printf("n的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//	*pFloat = 9.0;
//	printf("num的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//	system("pause");
//	return 0;
//}
//输出的结果是什么呢？
//
//int main()
//{
//	if (strlen("abc") - strlen("abcdef") > 0)
//	{
//		printf("eheh\n");
//	}
//	else
//	{
//		printf("haha\n");
//	}
//	system("pause");
//	return 0;
//}